[
    {
      "id": 1,
      "title": "GMMTV Announces 2025 BL/GL Lineup",
      "author": "Sportskeeda",
      "date": "2024-11-27",
      "excerpt": "GMMTV has revealed its 2025 lineup of around 20 BL and GL dramas, set to release throughout next year. Premiere dates are yet to be confirmed.",
      "image": "images/gmmtv-2025.png",
      "content": "GMMTV has revealed its 2025 lineup of around 20 BL and GL dramas, set to release throughout next year. Premiere dates are yet to be confirmed. The lineup includes fan-favorite series like \"Only Friends: Dream On\" and \"Dare You to Death,\" featuring popular CPs like Pond-Phuwin, Gemini-Fourth, and Earth-Mix. The genres range from romance to mystery and comedy, ensuring something for every fan.",
      "url": "https://www.sportskeeda.com/us/k-pop/from-girl-rules-burnout-syndrome-gmmtv-reveals-2025-bl-gl-thai-drama-lineup",
      "vipOnly": false
    },
    {
      "id": 2,
      "title": "The Boy Next World: A Multiverse Love Story",
      "author": "MyDramaList",
      "date": "2025-01-05",
      "excerpt": "Starring Boss Chaikamon and Noeul Nuttarat, \"The Boy Next World\" explores a multiverse romance where two lovers reunite across parallel worlds. The series is set to premiere on January 5, 2025.",
      "image": "images/the-boy-next-world.jpg",
      "content": "Starring Boss Chaikamon and Noeul Nuttarat, \"The Boy Next World\" explores a multiverse romance where two lovers reunite across parallel worlds. The series is set to premiere on January 5, 2025. The show has already generated buzz for its unique storyline and stunning visuals, promising to be a standout in the 2025 BL lineup.",
      "url": "https://mydramalist.com/747973-the-boy-next-world",
      "vipOnly": true
    },
    {
      "id": 3,
      "title": "Boys in Love: A Fresh Take on BL Drama",
      "author": "Lifestyle Asia India",
      "date": "2024-11-27",
      "excerpt": "GMMTV’s \"Boys in Love\" introduces rookie actors Mick Metas and Luke Peemsan in a lighthearted romantic comedy. Directed by Waa Waasuthep, the drama is set to release in mid-2025 and promises a fresh perspective on BL storytelling.",
      "image": "images/Boys.jpg",
      "content": "GMMTV’s \"Boys in Love\" introduces rookie actors Mick Metas and Luke Peemsan in a lighthearted romantic comedy. Directed by Waa Waasuthep, the drama is set to release in mid-2025 and promises a fresh perspective on BL storytelling. The series follows two young men navigating love and friendship, offering a mix of humor and heartfelt moments.",
      "url": "https://www.lifestyleasia.com/ind/entertainment/streaming/romantic-thai-dramas-releasing-in-2025/",
      "vipOnly": false
    },
    {
      "id": 4,
      "title": "Pit Babe Season 2: What to Expect",
      "author": "The BL Xpress",
      "date": "2024-11-27",
      "excerpt": "The highly anticipated second season of \"Pit Babe\" is set to release in 2025, with Pavel Naret and Pooh Krittin reprising their roles. Fans can expect more drama, romance, and high-speed action in this sequel.",
      "image": "images/pit-babes2.jpg",
      "content": "The highly anticipated second season of \"Pit Babe\" is set to release in 2025, with Pavel Naret and Pooh Krittin reprising their roles. Fans can expect more drama, romance, and high-speed action in this sequel. The first season left viewers on the edge of their seats, and the second season promises to deliver even more thrilling moments.",
      "url": "https://theblxpress.wordpress.com/2024/11/27/gmmtv-lineup-2025-riding-the-wave/",
      "vipOnly": true
    },
    {
      "id": 5,
      "title": "Ticket to Heaven: A Tale of Forbidden Love",
      "author": "Vocal Media",
      "date": "2024-11-27",
      "excerpt": "Gemini and Fourth star in \"Ticket to Heaven,\" a BL drama that tackles themes of religion and forbidden love. The series is already generating buzz for its emotional depth and powerful performances.",
      "image": "images/Ticket.jpeg",
      "content": "Gemini and Fourth star in \"Ticket to Heaven,\" a BL drama that tackles themes of religion and forbidden love. The series is already generating buzz for its emotional depth and powerful performances. The story follows two young men who must navigate societal expectations and their own feelings, creating a poignant and unforgettable narrative.",
      "url": "https://vocal.media/humor/gmmtv-2025-your-guide-to-the-exciting-new-lineup",
      "vipOnly": false
    }
  ]